In [1]:
import pandas as pd

In [7]:
df = pd.read_excel("students.xlsx")

In [8]:
df.head()

   학년  반  번호   이름
0   3  1   1  강지우
1   3  1   2  권민석
2   3  1   3  권소율
3   3  1   4  김수영
4   3  1   5  김연욱

In [23]:
def find_student(idx):
    num_filter = df["번호"] == int(idx)
    print(df[num_filter]["이름"].iloc[0])
    print(df[num_filter]["반"].iloc[0])

In [24]:
find_student(1)

강지우
1